app/controllers/api/v1/comments_controller.rb

  def index
    post_id = params[:post_id]
    @comments = Post.find(post_id).comments
---
SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = $1  [["post_id", 9]]
SELECT "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 9], ["LIMIT", 1]]