app/controllers/api/v1/posts_controller.rb

  def index
    user_id = params[:user_id]
    @posts = User.find(user_id).posts
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]