app/views/posts/index.html.erb


    <% if post.comments.length != 0 %>
    <div class=rectangle>
        <% post.most_recent_comments.each do |comment| %>
---
SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = $1  [["post_id", 1]]