app/views/posts/show.html.erb

</div>
<% if @post.comments.length != 0 %>
  <div class=rectangle>
    <% @post.comments.includes(:author).each do |comment| %>
---
SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = $1  [["post_id", 1]]