app/controllers/comments_controller.rb

SELECT "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
INSERT INTO "comments" ("text", "created_at", "updated_at", "author_id", "post_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["text", "Nice Work"], ["created_at", "2022-12-02 13:11:43.163813"], ["updated_at", "2022-12-02 13:11:43.163813"], ["author_id", 1], ["post_id", 1]]
---
  def create
    @post = Post.find(params[:post_id])
    @comment = @post.comments.new(
      text: comment_params[:text],
      author_id: current_user.id,
      post_id: @post.id
    )
    return unless @comment.save

SELECT "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = $1 AND "comments"."id" = $2 LIMIT $3  [["post_id", 5], ["id", 3], ["LIMIT", 1]]
DELETE FROM "comments" WHERE "comments"."id" = $1  [["id", 3]]
UPDATE "posts" SET "comments_counter" = COALESCE("comments_counter", 0) - $1 WHERE "posts"."id" = $2  [["comments_counter", 1], ["id", 3]]
---
  def destroy
    @post = Post.find(params[:post_id])
    @comment = @post.comments.find(params[:id])
    @comment.destroy
    if @comment.destroy
      @comment.update_comments_counter_when_deleted