app/controllers/likes_controller.rb

  def create
    @post = Post.find(params[:post_id])
    @like = @post.likes.new(author_id: current_user.id, post_id: @post.id)
    return if @like.save
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 8], ["LIMIT", 1]]
INSERT INTO "likes" ("created_at", "updated_at", "author_id", "post_id") VALUES ($1, $2, $3, $4) RETURNING "id"  [["created_at", "2022-12-02 14:11:05.393076"], ["updated_at", "2022-12-02 14:11:05.393076"], ["author_id", 1], ["post_id", 8]]