app/controllers/posts_controller.rb

SELECT "posts".* FROM "posts" WHERE "posts"."author_id" IS NULL LIMIT $1  [["LIMIT", 1]]
---
  def index
    @posts_all = Post.where(author_id: params[:user_id])