app/controllers/posts_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "comments".* FROM "comments" WHERE "comments"."post_id" IN ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11)  [["post_id", 1], ["post_id", 2], ["post_id", 3], ["post_id", 4], ["post_id", 5], ["post_id", 6], ["post_id", 12], ["post_id", 7], ["post_id", 8], ["post_id", 9], ["post_id", 10]]
SELECT "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]
---
  def index
    @user = User.find_by(id: params[:user_id])
    @posts_all = @user.posts.includes(:comments)

SELECT "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def show
    @posts = Post.find_by(id: params[:id])
    @user = User.find_by(id: params[:user_id])
    @post = @user.posts.find_by(id: params[:id])

INSERT INTO "posts" ("title", "text", "comments_counter", "likes_counter", "created_at", "updated_at", "author_id") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["title", "Hi"], ["text", "Hi"], ["comments_counter", 0], ["likes_counter", 0], ["created_at", "2022-12-07 10:40:49.299641"], ["updated_at", "2022-12-07 10:40:49.299641"], ["author_id", 1]]
---
  def create
    @user = current_user
    @post = @user.posts.new(title: post_params[:title], text: post_params[:text], comments_counter: 0, likes_counter: 0)
    return unless @post.save

SELECT "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
DELETE FROM "posts" WHERE "posts"."id" = $1  [["id", 1]]
DELETE FROM "comments" WHERE "comments"."id" = $1  [["id", 1]]
DELETE FROM "likes" WHERE "likes"."id" = $1  [["id", 1]]
---
  def destroy
    @post = Post.find(params[:id])
    @post.comments.destroy_all
    @post.likes.destroy_all
    @post.destroy