app/models/comment.rb

UPDATE "posts" SET "comments_counter" = COALESCE("comments_counter", 0) - $1 WHERE "posts"."id" = $2  [["comments_counter", 1], ["id", 3]]
---
  def update_comments_counter_when_deleted
    post.decrement!(:comments_counter)

UPDATE "posts" SET "comments_counter" = COALESCE("comments_counter", 0) + $1 WHERE "posts"."id" = $2  [["comments_counter", 1], ["id", 3]]
---
  def update_comments_counter
    post.increment!(:comments_counter)