app/models/like.rb

    def update_comments_counter
      post.increment!(:comments_counter)
---
UPDATE "posts" SET "likes_counter" = COALESCE("likes_counter", 0) + $1 WHERE "posts"."id" = $2  [["likes_counter", 1], ["id", 2]]